{
  "projects": [
    {
      "id": "anna-india",
      "title": "Psychooncology Conversational AI for local Indian languages",
      "description": "A sophisticated conversational AI assistant named \"Anna\" designed to provide psychological support for cancer patients and their families. Built with Next.js, the system features a comprehensive RAG (Retrieval Augmented Generation) pipeline using Pinecone vector database and integrates with Sarvam.ai's language model for multi-language support across 22 Indian languages. The system includes strict content filtering to avoid medical advice, LangSmith integration for observability, and rate limiting with fallback to Anthropic Claude when needed.",
      "category": "healthcare",
      "featured": true,
      "technologies": [
        "Next.js",
        "Pinecone",
        "Sarvam AI",
        "TypeScript",
        "RAG"
      ],
      "heroImageAlt": "Psychooncology Conversational AI for local Indian languages screenshot",
      "heroImage": "hero-1754845524286-941476878.png",
      "link": "https://psychooncologyhub.com/"
    },
    {
      "id": "medhub-ecosystem",
      "title": "MedHub Ecosystem - Medical Platform Suite",
      "description": "A comprehensive ecosystem of interconnected medical platforms designed to serve the entire healthcare workflow. The MedHub suite includes specialized applications for customer relationship management (CRM), social networking among healthcare professionals, AI-powered assistance, and environmental health monitoring. Built with modern web technologies and AI integration, these platforms work together to create a unified healthcare technology environment.",
      "category": "healthcare",
      "featured": true,
      "technologies": [
        "React",
        "Node.js",
        "PostgreSQL",
        "AI Integration"
      ]
    },
    {
      "id": "burnout-assistant",
      "title": "BurnOut Assistant - Tech Worker Mental Health",
      "description": "An open-source AI-powered mental health platform specifically designed to address burnout issues among technology professionals and healthcare workers. The system provides personalized therapeutic support, burnout assessment tools, and evidence-based intervention strategies tailored to the unique stressors and challenges faced by people working in high-stress technical environments. Built with accessibility, privacy, and professional-grade mental health support as core principles.",
      "category": "healthcare",
      "featured": true,
      "technologies": [
        "Python",
        "OpenAI",
        "Mental Health AI",
        "Open Source"
      ]
    },
    {
      "id": "agi-detector",
      "title": "AGI Detector - Emergence Monitoring System",
      "description": "A sophisticated early-warning system that monitors the AI landscape for genuine indicators of Artificial General Intelligence development. The system features multi-source crawling across 7 major AI sources (OpenAI, DeepMind, Anthropic, Microsoft AI, arXiv, TechCrunch, VentureBeats), GPT-4.1-mini powered analysis for cost-effective detection, and real-time alerts with severity classification. Includes advanced web crawling with Playwright automation, cross-validation systems, and comprehensive trend visualization with historical tracking.",
      "category": "research",
      "featured": true,
      "technologies": [
        "Python",
        "GPT-4",
        "Web Scraping",
        "Real-time Analytics"
      ]
    },
    {
      "id": "agentic-design",
      "title": "Agentic Design - Autonomous Creative Framework",
      "description": "A revolutionary framework for autonomous creative content generation that breaks free from typical AI aesthetics and generic patterns. Utilizing LionAGI and SPARC (Strategic Planning and Reasoning Capabilities) methodology, this system creates unique image and video prompts that avoid the homogenized look commonly associated with AI-generated content. The framework emphasizes originality, cultural authenticity, and creative diversity while maintaining professional quality and artistic coherence.",
      "category": "research",
      "featured": true,
      "technologies": [
        "LionAGI",
        "SPARC",
        "Creative AI",
        "Python"
      ]
    },
    {
      "id": "bds-automation",
      "title": "BDS Automation - Utility Company Workflow",
      "description": "A sophisticated n8n automation workflow designed for Severn Trent Water to process Big Difference Scheme (BDS) applications automatically. The system handles customer data validation, discount calculations based on income thresholds, database operations, and comprehensive audit logging. Features advanced error handling, real-time notifications, and seamless integration with existing utility company systems.",
      "category": "automation",
      "featured": true,
      "technologies": [
        "n8n",
        "Workflow Automation",
        "API Integration"
      ]
    },
    {
      "id": "customer-service-agents",
      "title": "Multi-Agent Customer Service System",
      "description": "An intelligent customer service system built with Flowise featuring specialized AI agents that automatically route customer inquiries to the appropriate specialist. The system includes a condition agent that analyzes customer intent and seamlessly hands off conversations to refund agents, sales agents, or general support agents. Designed for Blinds2Go with advanced natural language processing and contextual understanding.",
      "category": "automation",
      "featured": true,
      "technologies": [
        "Flowise",
        "Multi-Agent Systems",
        "Customer Service AI"
      ]
    },
    {
      "id": "marketing-automation",
      "title": "Weather-Based Marketing Automation",
      "description": "An intelligent marketing automation system that monitors Met Office weather warnings and automatically generates targeted social media content. The system specializes in creating water conservation messaging during heat waves, combining real-time weather data with contextual water-saving tips and regional alerts. Features sophisticated content generation, duplicate prevention, and multi-platform distribution capabilities.",
      "category": "automation",
      "featured": true,
      "technologies": [
        "Weather API",
        "Content Generation",
        "Social Media Automation"
      ]
    },
    {
      "id": "pwa-news",
      "title": "PWA News Reader - Modern Offline App",
      "description": "A sophisticated Progressive Web App news reader featuring offline reading capabilities, smooth Framer Motion animations, and a native app-like experience. The application includes real RSS feed integration, comprehensive PWA features (install to home screen, background sync, push notifications), and advanced UI with dark/light themes. Built with modern React patterns and optimized for performance with <500KB bundle size and <3s load time.",
      "category": "webapp",
      "featured": true,
      "technologies": [
        "React 19",
        "PWA",
        "Service Workers",
        "Offline-first"
      ]
    },
    {
      "id": "yelloai",
      "title": "YelloAI - AI-Powered Directory Service",
      "description": "A sophisticated directory and search platform that combines traditional business directory functionality with AI-powered recommendations and intelligent search capabilities. Built with a database-centric architecture utilizing PostgreSQL's advanced features including PLpgSQL stored procedures for complex business logic. The platform leverages artificial intelligence to provide personalized recommendations, semantic search, and intelligent categorization of business listings and services.",
      "category": "webapp",
      "featured": true,
      "technologies": [
        "PostgreSQL",
        "PLpgSQL",
        "AI Recommendations",
        "Search"
      ]
    },
    {
      "id": "propwise",
      "title": "PropWise - AI Property Intelligence",
      "description": "Comprehensive property analysis platform that leverages AI vision technology to generate detailed reports from satellite and street-level imagery. Features multi-view property analysis, bilingual support (English/Hungarian), interactive controls for image manipulation, and editable AI-generated reports. Integrates multiple Google Maps APIs with GPT-4 Vision for professional property assessment, providing real estate professionals with actionable insights for investment decisions and market analysis.",
      "category": "business",
      "featured": true,
      "technologies": [
        "GPT-4 Vision",
        "Property Analysis",
        "Bilingual Support"
      ]
    },
    {
      "id": "blinds2go",
      "title": "Blinds2Go - E-commerce Platform Enhancement",
      "description": "A comprehensive enhancement of the Blinds2Go e-commerce platform specializing in custom window treatments and blinds. The project includes advanced product customization tools, AI-powered customer service integration, intelligent search and filtering capabilities, and sophisticated measurement and installation guidance systems. Built with modern e-commerce best practices, the platform provides a seamless customer experience from product discovery to installation support.",
      "category": "business",
      "featured": true,
      "technologies": [
        "E-commerce",
        "Product Customization",
        "AI Customer Service"
      ]
    },
    {
      "id": "transcribe7sec",
      "title": "Transcribe7Sec - Ultra-Fast Audio Processing",
      "description": "A specialized audio transcription service optimized for processing short audio clips within 7 seconds. The system prioritizes speed and accuracy for real-time applications, making it ideal for voice notes, quick voice commands, meeting snippets, and instant messaging voice replies. Built with advanced speech recognition models and optimized processing pipelines to deliver transcription results in near real-time.",
      "category": "tools",
      "featured": true,
      "technologies": [
        "Audio Processing",
        "Real-time",
        "High Performance"
      ]
    },
    {
      "id": "dxf-analyzer",
      "title": "DXF Analyzer - CAD File Intelligence",
      "description": "A specialized analysis tool for DXF (Drawing eXchange Format) files that automatically extracts meaningful information from technical drawings and CAD files. The system provides automated feature recognition, dimensional analysis, architectural plan interpretation, and intelligent insights from engineering drawings. Designed for architects, engineers, and construction professionals who need to quickly analyze and understand complex technical drawings.",
      "category": "tools",
      "featured": true,
      "technologies": [
        "CAD Analysis",
        "DXF Processing",
        "Technical Drawings"
      ]
    },
    {
      "id": "curato-ai-news",
      "title": "Curato AI News - Intelligent Aggregation",
      "description": "An AI-powered news aggregation and curation platform that intelligently collects, analyzes, and presents news from thousands of sources worldwide. The system uses advanced natural language processing to provide personalized news recommendations, content quality scoring, bias detection, and intelligent filtering. Designed to cut through information overload and deliver relevant, high-quality news content tailored to individual preferences and interests.",
      "category": "analytics",
      "featured": true,
      "technologies": [
        "News Aggregation",
        "AI Curation",
        "Content Scoring"
      ]
    },
    {
      "id": "review-analyser",
      "title": "Review Analyser - B2B Intelligence Platform",
      "description": "A sophisticated business intelligence platform that analyzes customer reviews and feedback at scale using advanced swarm-based architecture. The system processes thousands of reviews from multiple sources to provide actionable insights, sentiment analysis, competitive intelligence, and customer experience optimization recommendations. Built specifically for B2B companies looking to understand customer sentiment and market positioning through comprehensive review data analysis.",
      "category": "analytics",
      "featured": true,
      "technologies": [
        "Swarm Architecture",
        "Sentiment Analysis",
        "B2B Intelligence"
      ]
    },
    {
      "id": "neural-design",
      "title": "Neural Design - AI-Driven Interface System",
      "description": "An experimental design system that applies neural network principles to user interface design, creating dynamic, adaptive interfaces that evolve based on user interaction patterns. The system features AI-driven layout optimization, adaptive components that learn from user behavior, and neural network-inspired visual patterns. This represents a new paradigm in interface design where the UI becomes an intelligent, learning system rather than a static presentation layer.",
      "category": "design",
      "featured": true,
      "technologies": [
        "Neural Networks",
        "Dynamic Interfaces",
        "AI Design"
      ]
    },
    {
      "id": "social-content",
      "title": "Social Content Gen - MCP Platform",
      "description": "An advanced social media content generation and scheduling platform utilizing Model Context Protocol (MCP) for content search, generation, and visual asset creation. The system integrates multiple AI models for content creation and includes sophisticated scheduling capabilities for social media management. Built with modern TypeScript architecture, it provides seamless workflows for content creators and marketing teams to generate, optimize, and distribute content across multiple platforms with AI assistance.",
      "category": "design",
      "featured": true,
      "technologies": [
        "Model Context Protocol",
        "Multi-AI Integration",
        "Visual Content"
      ]
    },
    {
      "id": "dr-balsai-suite",
      "title": "Dr. Balsai Medical Applications Suite",
      "description": "Complete medical practice management ecosystem including main application, internal video platform, and Hungarian podcast transcript extraction for medical professional content.",
      "category": "healthcare",
      "featured": true,
      "technologies": [
        "Next.js App Router",
        "Supabase",
        "Python",
        "YouTube APIs"
      ]
    },
    {
      "id": "onko24",
      "title": "Oncology Care Management Platform (Onko24)",
      "description": "Advanced oncology care management platform with database optimization for large medical datasets, status monitoring, and specialized PDF processing for medical documents.",
      "category": "healthcare",
      "featured": true,
      "technologies": [
        "React",
        "Medical Databases",
        "PDF Processing",
        "Monitoring APIs"
      ]
    },
    {
      "id": "dental-suite",
      "title": "Comprehensive Dental Practice Suite",
      "description": "Complete dental practice management ecosystem including VIPDental management system, PerfectSmile monitoring, and specialized analytics for dental practice optimization.",
      "category": "healthcare",
      "featured": true,
      "technologies": [
        "TypeScript",
        "React",
        "Node.js",
        "Analytics"
      ]
    },
    {
      "id": "medhub-crm",
      "title": "MEDHUB-CRM - Medical Customer Relationship Management",
      "description": "Advanced CRM system specifically designed for medical practices with patient management, appointment scheduling, and healthcare workflow optimization.",
      "category": "healthcare",
      "featured": false,
      "technologies": [
        "Next.js",
        "TypeScript",
        "Supabase"
      ]
    },
    {
      "id": "medhub-social",
      "title": "MEDHUB-SOCIAL - Medical Professional Social Platform",
      "description": "Social networking platform designed for healthcare professionals to collaborate, share knowledge, and connect within the medical community.",
      "category": "healthcare",
      "featured": false,
      "technologies": [
        "React",
        "TailwindCSS",
        "PostgreSQL"
      ]
    },
    {
      "id": "elitemed",
      "title": "EliteMed - Elite Medical Services Platform",
      "description": "Premium medical services platform designed for high-end healthcare delivery with advanced medical API integrations.",
      "category": "healthcare",
      "featured": false,
      "technologies": [
        "Next.js",
        "Medical APIs",
        "Premium Services"
      ]
    },
    {
      "id": "medhub-eco",
      "title": "MEDHUB-ECO - Environmental Health Platform",
      "description": "Ecological and environmental health monitoring platform focusing on environmental factors affecting public health and medical outcomes.",
      "category": "healthcare",
      "featured": false,
      "technologies": [
        "React",
        "Environmental APIs",
        "Health Analytics"
      ]
    },
    {
      "id": "medhub-cohere",
      "title": "MEDHUB-cohere - AI Integration with Cohere Models",
      "description": "AI-powered medical platform integration using Cohere language models for advanced natural language processing in healthcare contexts.",
      "category": "healthcare",
      "featured": false,
      "technologies": [
        "Node.js",
        "Cohere API",
        "PostgreSQL"
      ]
    },
    {
      "id": "medhub-cohere-shadcn",
      "title": "MEDHUB-cohere-shadcn - Enhanced UI with Shadcn Components",
      "description": "Enhanced version of the MedHub Cohere integration featuring modern UI components and improved user experience design.",
      "category": "healthcare",
      "featured": false,
      "technologies": [
        "React",
        "Shadcn UI",
        "Cohere API"
      ]
    },
    {
      "id": "medhub-convos-patient-detection",
      "title": "medhub-convos-patient-detection - Patient Conversation Monitoring",
      "description": "Advanced AI system for monitoring and analyzing patient conversations to detect health concerns and provide clinical insights.",
      "category": "healthcare",
      "featured": false,
      "technologies": [
        "AI/ML",
        "NLP",
        "Patient Analytics"
      ]
    },
    {
      "id": "medhub-site",
      "title": "medhub-site - Main MedHub Website",
      "description": "Primary website and landing pages for the MedHub ecosystem, showcasing medical services and platform capabilities.",
      "category": "healthcare",
      "featured": false,
      "technologies": [
        "Next.js",
        "Static Site Generation",
        "Medical Content"
      ]
    },
    {
      "id": "medhub3",
      "title": "medhub3 - Third Generation Platform",
      "description": "Latest iteration of the core MedHub platform with modern React architecture and enhanced medical workflow capabilities.",
      "category": "healthcare",
      "featured": false,
      "technologies": [
        "Modern React",
        "TypeScript",
        "Advanced Architecture"
      ]
    },
    {
      "id": "convo-monitor-perfectsmile",
      "title": "convo-monitor-perfectsmile-monitor - Specialized Dental Conversation Monitoring",
      "description": "Advanced conversation monitoring system specifically designed for dental practice customer service and patient communication analysis.",
      "category": "healthcare",
      "featured": false,
      "technologies": [
        "AI Monitoring",
        "Dental Services",
        "Customer Service Analytics"
      ]
    },
    {
      "id": "onko24-anthropicstatus",
      "title": "onko24-anthropicstatus - Oncology Service Status Monitoring",
      "description": "Real-time status monitoring system for oncology services ensuring continuous availability and performance tracking.",
      "category": "healthcare",
      "featured": false,
      "technologies": [
        "Monitoring APIs",
        "Status Tracking",
        "Service Health"
      ]
    },
    {
      "id": "onkodb",
      "title": "onkodb - Oncology Database Management System",
      "description": "Advanced database management system optimized for oncology data with large dataset handling and medical record optimization.",
      "category": "healthcare",
      "featured": false,
      "technologies": [
        "Database Optimization",
        "Large Datasets",
        "Medical Records"
      ]
    },
    {
      "id": "onkodb-processed",
      "title": "onkodb-processed - Processed Oncology Data Management",
      "description": "Specialized system for managing processed oncology data with advanced data processing pipelines and analytics capabilities.",
      "category": "healthcare",
      "featured": false,
      "technologies": [
        "Data Processing",
        "Analytics Pipelines",
        "Medical Data"
      ]
    },
    {
      "id": "onkodb-problematic-large-pdfs",
      "title": "onkodb-problematic-large-pdfs - Large Medical PDF Processing",
      "description": "Specialized tool for processing large and complex PDF documents in medical environments with advanced file handling capabilities.",
      "category": "healthcare",
      "featured": false,
      "technologies": [
        "PDF Processing",
        "File Handling",
        "Medical Documents"
      ]
    },
    {
      "id": "preciz",
      "title": "preciz - Medical Precision Diagnostic Tool",
      "description": "Advanced precision diagnostic tool with medical device integrations for accurate diagnosis and treatment planning.",
      "category": "healthcare",
      "featured": false,
      "technologies": [
        "TypeScript",
        "Medical Device Integration",
        "Diagnostic Tools"
      ]
    },
    {
      "id": "vipdental",
      "title": "vipdental - Dental Practice Management System",
      "description": "Comprehensive dental practice management application with patient management, appointment scheduling, and dental workflow optimization.",
      "category": "healthcare",
      "featured": false,
      "technologies": [
        "TypeScript",
        "React",
        "Next.js"
      ]
    },
    {
      "id": "open-health",
      "title": "open-health - Open Source Health Platform",
      "description": "Open source health platform with public APIs and community-driven healthcare tools for broader medical community access.",
      "category": "healthcare",
      "featured": false,
      "technologies": [
        "React",
        "Open APIs",
        "Community Driven"
      ]
    },
    {
      "id": "hodinka-reumatologia",
      "title": "Rheumatology Foundation Conversational AI Platform",
      "description": "Specialized website for rheumatology practice with patient portal and medical service information.",
      "category": "healthcare",
      "featured": false,
      "technologies": [
        "Medical Website",
        "Patient Portal",
        "Rheumatology Focus"
      ],
      "heroImageAlt": ""
    },
    {
      "id": "medhubaai-newsletter",
      "title": "MedHubAI-NEWSLETTER - Medical AI Newsletter Platform",
      "description": "Automated newsletter platform focusing on medical AI developments with content management and email automation capabilities.",
      "category": "healthcare",
      "featured": false,
      "technologies": [
        "Content Management",
        "Email Automation",
        "Medical AI Content"
      ]
    },
    {
      "id": "chronic-health-ai",
      "title": "Chronic_Health_AI - AI-Assisted Chronic Illness Management",
      "description": "Comprehensive platform using AI chatbots like Claude and ChatGPT to help track, diagnose, and support recovery from chronic illnesses.",
      "category": "healthcare",
      "featured": false,
      "technologies": [
        "AI Integration",
        "Health Analytics",
        "Chronic Care"
      ]
    },
    {
      "id": "morphic",
      "title": "Morphic - AI-Powered Search Engine",
      "description": "AI-powered search engine with generative UI, intelligent query processing, and advanced result synthesis. Features real-time information gathering and contextual response generation.",
      "category": "research",
      "featured": true,
      "technologies": [
        "Generative UI",
        "AI Search",
        "Real-time Processing",
        "Claude Code"
      ]
    },
    {
      "id": "sparc-evolution",
      "title": "SPARC Evolution - Advanced Problem-Solving Framework",
      "description": "Evolution of the SPARC framework for structured problem-solving with enhanced AI integration, automated analysis, and iterative refinement capabilities.",
      "category": "research",
      "featured": true,
      "technologies": [
        "SPARC Framework",
        "Problem Solving",
        "AI Integration",
        "Iterative Analysis"
      ]
    },
    {
      "id": "tersa",
      "title": "Tersa - Open Source AI Workflow Canvas",
      "description": "Open source AI workflow canvas for visual programming and automation, enabling drag-and-drop AI pipeline creation with community contributions.",
      "category": "research",
      "featured": true,
      "technologies": [
        "Open Source",
        "Visual Programming",
        "AI Workflows",
        "Community Driven"
      ]
    },
    {
      "id": "open-notebooklm",
      "title": "Open NotebookLM - PDF to Podcast Conversion",
      "description": "Open source tool for converting PDF documents to podcast-style audio content using advanced AI narration and content structuring.",
      "category": "research",
      "featured": true,
      "technologies": [
        "PDF Processing",
        "Audio Generation",
        "AI Narration",
        "Open Source"
      ]
    },
    {
      "id": "swarm-coordination",
      "title": "AI Agent Swarm Coordination Platform",
      "description": "Advanced multi-agent coordination platform enabling swarm-based architecture for distributed AI processing, intelligent task allocation, and coordinated agent collaboration.",
      "category": "automation",
      "featured": true,
      "technologies": [
        "Multi-agent Systems",
        "Coordination",
        "Distributed Processing",
        "Intelligent Allocation"
      ]
    },
    {
      "id": "voice-deepgram",
      "title": "Voice-Enabled AI Agent with Deepgram",
      "description": "Sophisticated voice-enabled AI agent utilizing Deepgram SDK for real-time speech processing, WebSocket communication, and natural language interaction capabilities.",
      "category": "automation",
      "featured": true,
      "technologies": [
        "Node.js",
        "TypeScript",
        "Deepgram SDK",
        "WebSockets",
        "Voice Processing"
      ]
    },
    {
      "id": "b2b-review-swarm",
      "title": "B2B Review Analysis Platform with Swarm Architecture",
      "description": "Sophisticated B2B review analysis platform utilizing swarm-based architecture for distributed processing of customer reviews and feedback with Claude Code integration.",
      "category": "automation",
      "featured": true,
      "technologies": [
        "TypeScript",
        "Claude Code",
        "Swarm Architecture",
        "Review Analysis"
      ]
    },
    {
      "id": "n8n-water-scraping",
      "title": "N8N Water Utility Data Scraping Automation",
      "description": "Advanced n8n automation workflow for scraping water utility data from Severn Trent Water and Portsmouth Water, with dedicated landing page for data service marketing.",
      "category": "automation",
      "featured": true,
      "technologies": [
        "n8n Automation",
        "Utility Data",
        "Web Scraping",
        "Data Processing"
      ]
    },
    {
      "id": "automation-detector",
      "title": "Automation Detector - Bot Detection System",
      "description": "Advanced bot and automation detection system with security features, browser fingerprinting, and sophisticated algorithms to identify automated behavior patterns.",
      "category": "automation",
      "featured": true,
      "technologies": [
        "Security",
        "Browser Fingerprinting",
        "Bot Detection",
        "Pattern Analysis"
      ]
    },
    {
      "id": "gemini-live",
      "title": "Gemini Live - Real-time AI Interactions",
      "description": "Live Google Gemini AI integration platform with React and WebRTC for real-time AI interactions, conversational interfaces, and dynamic response generation.",
      "category": "automation",
      "featured": true,
      "technologies": [
        "React",
        "Google Gemini API",
        "WebRTC",
        "Real-time Processing"
      ]
    },
    {
      "id": "astro-blog-template",
      "title": "Modern Astro Blog Template",
      "description": "Modern, performant blog template built with Astro featuring static site generation, optimized performance, and modern design patterns for content-focused websites.",
      "category": "webapp",
      "featured": true,
      "technologies": [
        "Astro",
        "Static Site Generation",
        "Performance Optimization",
        "Modern Design"
      ]
    },
    {
      "id": "figma-workflow",
      "title": "Figma to Website Workflow Demonstration",
      "description": "Complete workflow demonstration showing the conversion from Figma designs to production websites with automated asset extraction and code generation.",
      "category": "webapp",
      "featured": true,
      "technologies": [
        "Figma API",
        "Workflow Automation",
        "Asset Extraction",
        "Code Generation"
      ]
    },
    {
      "id": "nective",
      "title": "Nective - Client Platform Suite",
      "description": "Comprehensive client platform suite featuring project management, collaboration tools, and integrated business workflows for professional service organizations.",
      "category": "business",
      "featured": true,
      "technologies": [
        "Next.js",
        "Project Management",
        "Collaboration",
        "Business Workflows"
      ]
    },
    {
      "id": "paris-noble",
      "title": "Paris Noble - Professional Portfolio Platform",
      "description": "Elegant professional portfolio platform with sophisticated branding, responsive design, and content management capabilities for creative professionals.",
      "category": "business",
      "featured": true,
      "technologies": [
        "Portfolio Design",
        "Professional Branding",
        "Content Management",
        "Responsive Design"
      ]
    },
    {
      "id": "claude-code-extensions",
      "title": "Claude Code Integrations & Extensions",
      "description": "Collection of integrations and extensions for Claude Code including workflow automation, template generation, and development productivity enhancements.",
      "category": "tools",
      "featured": true,
      "technologies": [
        "Claude Code",
        "Workflow Automation",
        "Template Generation",
        "Development Tools"
      ]
    },
    {
      "id": "audio-transcription-suite",
      "title": "Audio Transcription & Processing Suite",
      "description": "Comprehensive suite of audio transcription tools with multiple AI provider integrations, real-time processing, and advanced audio analysis capabilities.",
      "category": "tools",
      "featured": true,
      "technologies": [
        "Audio Processing",
        "Multiple AI Providers",
        "Real-time Transcription",
        "Audio Analysis"
      ]
    },
    {
      "id": "cold-email-gemini",
      "title": "Cold Email Generation with Gemini AI",
      "description": "Advanced cold email generation system using Google Gemini AI for personalized outreach, A/B testing, and performance analytics with high conversion optimization.",
      "category": "analytics",
      "featured": true,
      "technologies": [
        "Google Gemini AI",
        "Email Automation",
        "A/B Testing",
        "Performance Analytics"
      ]
    },
    {
      "id": "growth-analytics",
      "title": "Growth Analytics & Social Intelligence",
      "description": "Comprehensive growth analytics platform with social media intelligence, user behavior analysis, and predictive growth modeling for business optimization.",
      "category": "analytics",
      "featured": true,
      "technologies": [
        "Growth Analytics",
        "Social Intelligence",
        "Predictive Modeling",
        "Business Optimization"
      ]
    },
    {
      "id": "agentic-ux-patterns",
      "title": "Agentic Design - AI Agent UX Patterns",
      "description": "Comprehensive UX pattern library specifically designed for AI agent interfaces, featuring conversational UI patterns, progressive disclosure, and trust-building design elements.",
      "category": "design",
      "featured": true,
      "technologies": [
        "UX Patterns",
        "AI Interfaces",
        "Conversational UI",
        "Trust Design"
      ]
    },
    {
      "id": "animation-libraries",
      "title": "Animation Libraries & Motion Design",
      "description": "Collection of modern animation libraries and motion design systems with React integration, micro-interactions, and performance-optimized animations.",
      "category": "design",
      "featured": true,
      "technologies": [
        "Animation Libraries",
        "Motion Design",
        "React Animation",
        "Micro-interactions"
      ]
    }
  ],
  "lastUpdated": "2025-08-10T19:50:16.183Z"
}